<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class InsuranceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('insurances')->delete();
        DB::table('insurances')->insert([
            'name' => 'آروب للتأمين',
            'insurance_code'=>'COMP1001',
            'discount_percentage'=>'20',
            'company_rate'=> 80,
            'status'=>1,
            'notes' => 'سعى آروب للتأمين لتوفير أفضل الحلول التأمينية لعملائها من خلال تصميم حلول وبرامج تأمينية تتوافق مع احتياجاتهم. وتوفر الشركة العديد من برامج التأمين الطبي المختلفة والتي يمكن تعدليها بناء على متطلبات العميل. بالإضافة إلى ذلك،  توفر آروب حلول التأمين الطبي بأسعار ملائمة .',
        ]);

        DB::table('insurances')->insert([
            'name' => 'آكسا للتأمين',
            'insurance_code'=>'COMP1002',
            'discount_percentage'=>'10',
            'company_rate'=> 90,
            'status'=>1,
            'notes' => 'شركة آكسا هي احد الشركات العالمية التي تقدم خدماتها في أكثر من 57 بلد حول العالم، وبدأت في تقديم خدماتها التأمينية في مصر منذ عام 2015]);',
        ]);

        DB::table('insurances')->insert([
            'name' => 'بوبا',
            'insurance_code'=>'COMP1003',
            'discount_percentage'=>'30',
            'company_rate'=> 70,
            'status'=> 1,
            'notes' => 'وبا العالمية هي شركة رائدة في التأمين الصحي الخاص الدولي تتميز بتقديم التغطية التأمينية لعملائها في أي مكان حول العالم. وبتواجدها في كل دول العالم توفر بوبا خطط تأمين طبي شاملة تلبي احتياجات الأفراد والعائلات والشركات.',
        ]);


        DB::table('insurances')->insert([
            'name' => 'شركة أليانز',
            'insurance_code'=>'COMP1004',
            'discount_percentage'=>'30',
            'company_rate'=> 70,
            'status'=>1,
            'notes' => 'تعد شركة أليانز أحد أبرز شركات التأمين العالمية الموجودة في مصر، وتقدم اليانز خدماتها لأكثر من 85 مليون عميل في 75 دولة حول العالم. وتقدم اليانز العديد من التغطيات والبرامج التأمينية ومنها التأمين الطبي.',
        ]);

        DB::table('insurances')->insert([
            'name' => 'شركة GIG للتأمين',
            'insurance_code'=>'COMP1005',
            'discount_percentage'=>'25',
            'company_rate'=> 75,
            'status'=>1,
            'notes' => 'عد شركة GIG أحد أبرز شركات التأمين التي تحقق نموا سريعا ومتزايدا في مصر. حيث تلتزم الشركة بتلبية الاحتياجات المتغيرة لعملائها من خلال تقديم خيارات وحلول شاملة للتغطية الطبية والتي تشمل مجموعة من خطط التأمين الطبي المُصممة لتناسب الميزانيات والاحتياجات المختلفة للعملاء',
        ]);

        DB::table('insurances')->insert([
            'name' => 'لشركة اللبنانية السويسرية تكافل مصر',
            'insurance_code'=>'COMP1006',
            'discount_percentage'=>'50',
            'company_rate'=> 50,
            'status'=>1,
            'notes' => 'تقدم الشركة اللبنانية السويسرية مجموعة واسعة من وثائق التأمين الطبي التي تلبي احتياجات مختلف فئات المجتمع. وتلتزم بتوفير  تغطية طبية شاملة لعملائها تمكن حاملي الوثائق الوصول إلى  شبكة واسعة ومتنوعة من مقدمي الرعاية الصحية والخدمات عالية الجودة. بالإضافة إلى ذلك، توفر الشركة إمكانية أن تشمل التغطية منطقة الخليج العربي والشرق الأوسط وشمال أفريقيا، مما يوسع نطاق الحماية والتغطية لحاملي الوثائق في خطط التأمين المحلية',
        ]);

        DB::table('insurances')->insert([
            'name' => 'اورينت للتأمين التكافلي',
            'insurance_code'=>'COMP1007',
            'discount_percentage'=>'40',
            'company_rate'=> 60,
            'status'=>1,
            'notes' => 'تتميز شركة اورينت للتأمين التكافلي بتوفير خطط وبرامج للتأمين الطبي مصممة خصيصًا للشركات الصغيرة والمتوسطة، تمكن هذه الخطط والبرامج حاملي الوثائق من تخصيص تغطيتهم بناءً على احتياجاتهم',
        ]);
        DB::table('insurances')->latest()->update(['status' => 1]);

    }
}

