<?php

// ArabicNameProvider.php

namespace App\Providers;

use Faker\Provider\Base;

class ArabicNameProvider extends Base
{
    protected static $male = [
        'محمد العزب ابراهيم الجمال',
        'اسماعيل عبد الستار عبد السلام ',
        'مصطفى محمد عبد الجواد سعد',
        'محمد حماد ابراهيم اسماعيل',
        'محمود رأفت محمد ابو العزم',
        'أحمد مجدي المغاوري الشقفي',
        'أحمد إبراهيم فريد عفيفي',
        'علاء عبد الوهاب رمضان عربي',
        'محمد جودت علي عبود',
        'فتحي طارق أحمد خفاجا',
        'محمد بدران محمد الدمرداش عمرو',
        'علاء السيد محمود ذكى ',
        'خليفه مرزوق شوقى',
        'هشام محمود احمد العلايلى',
        'محمد اسماعيل مصطفى محمد',
        'أحمد علاء محمد عبود',
        'هشام بدران السيد رمضان',
        'سامح عبدالسميع السيد',
        'أحمد محمد جمال الوردانى',
        // Add more male names as needed
    ];

    protected static $female = [
        'ثناء محمد عبد ربه موسى الكلبشاوي',
        'هدى رضا عبد العزيز الأتربي',
        'هاجر أحمد محمد عودة',
        'شروق عصام صبحي مطاوع',
        'إيمان جمال رمضان حوتر',
        'رباب أحمد شحاتة',
        'سارة طارق عباس سالم البدوي',
        'منال يحي محمود سليم',
        'أميرة السيد عبد العال',
        'سجده الدسوق ابراهيم الأقرع',
        'ايمان صالح يونس حسن ابو كريمة',
        'دينا ابو زيد سعد السعيدي',
        'هدى رضا عبد العال العزبى',
        'ياسمين عبد الرسول حسن صالح',
        'مروة بسيوني عبد الله ',
        'مروة مصطفى السيد المزين',
        'يسرا محمد زكي النجار',
        'أماني حلمي زايد علام',
        'هاجر عاطف عبد السلام عطوان',
        'هيام محمد عبده ابو يوسف',
        // Add more female names as needed
    ];

    public function arabicName($gender = null)
    {
        $names = $gender == 'male' ? static::$male : static::$female;
        return static::randomElement($names);
    }


}

